artillery/attempt-purchase.yml
config:
    target: 'http://localhost:8000'
    phases:
        - duration: 4
          arrivalRate: 1000
    payload:
        fields:
            - email
            - password
            - token
        path: ./users.csv
    defaults:
        headers:
            Content-Type: 'application/json'

scenarios:
    - name: Attempt purchase flow
      flow:
          - post:
                url: '/orders'
                headers:
                    Authorization: 'Bearer {{ token }}'
                json:
                    productId: '550e8400-e29b-41d4-a716-446655440000'